Tekla Open API Reference for Tekla Structures 2025
PlacingTypes.LeaderLinePlacing Method
 The object is placed attached to a leader line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PlacingBase LeaderLinePlacing(
	Point LeaderLineStartPoint
)
Public Shared Function LeaderLinePlacing (
	LeaderLineStartPoint As Point
) As PlacingBase
Parameters
LeaderLineStartPoint
Type: Tekla.Structures.Geometry3d.Point
The start point of the leader line.
Return Value
Type: PlacingBase
A new leader line placing instance.
See Also
Reference
PlacingTypes Class
Tekla.Structures.Drawing Namespace